# Brewfile - Data Science & Automation Environment

# Core Python tools
brew "uv"                # Fast Python package management

# Essential development tools
brew "git"               # Version control
brew "gh"                # GitHub CLI
brew "neovim"            # Text editor
brew "tmux"              # Terminal multiplexer

# Xcode development
mas "Xcode", id: 497799835
cask "xcode-command-line-tools"
brew "swiftlint"         # Swift code linting tool
# Note: After installation, run: sudo xcodebuild -license accept

# Node.js for Claude Code
brew "node"              # Node.js runtime
brew "npm"               # Node package manager
brew "oven-sh/bun/bun"   # Fast JavaScript runtime and package manager

# Cloud deployment tools
brew "cloudflared"       # Cloudflare Tunnel client
brew "flyctl"            # Fly.io CLI for app deployment
brew "cloudflare-wrangler"  # Cloudflare Workers CLI

# Useful utilities
brew "tree"              # Directory visualization
brew "htop"              # Better top command
brew "jq"                # JSON processor
brew "yq"                # YAML processor
brew "curl"              # HTTP client
brew "wget"              # File downloader
brew "ripgrep"           # Fast text search
brew "fd"                # Fast file find
brew "bat"               # Better cat with syntax highlighting
brew "eza"               # Better ls with colors
brew "coreutils"         # Adds utils like gtimeout
brew "tectonic"          # typesetting docs using TeX & LaTeX
brew "poppler"           # PDF rendering library
brew "duckdb"            # Fast in-process database system
brew "pandoc"            # Universal document converter

# Terminal improvements
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"          # Cross-shell prompt

# Terminal and productivity
cask "ghostty"           # Modern terminal
cask "nikitabobko/tap/aerospace"
cask "docker"            # Containerization

# Browser
cask "firefox"           # Fast, privacy-focused browser (pair with Betterfox)

# Optional productivity apps
cask "raycast"           # Spotlight replacement (optional)
cask "bitwarden"         # Password manager (optional)

# Family/Personal apps
cask "vlc"               # Media player for family videos
cask "zoom"              # Video calls with family

# Mac App Store CLI
brew "mas"
